# Utilities
brew 'bash'
brew 'zsh'
brew 'git'
brew 'the_silver_searcher'
brew 'wget'
brew 'tree'
brew 'coreutils'
tap 'universal-ctags/universal-ctags'
brew 'universal-ctags'
brew 'vim', args: %w[--with-override-system-vi]
tap 'neovim/homebrew-neovim'
brew 'neovim'
brew 'ssh-copy-id'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'unar'
brew 'p7zip'

# Linters and Languages
brew 'shellcheck'
brew 'python'
brew 'opam'
brew 'haskell-stack'

# Completion
tap 'Homebrew/homebrew-completions'
brew 'bash-completion'
brew 'zsh-completions'
brew 'vagrant-completion' # for cask 'vagrant'

# Cask
cask 'google-chrome'
cask 'torbrowser'
cask 'dropbox'
cask 'eclipse-java'
cask 'vagrant'
cask 'iterm2'
cask 'quicksilver'
cask '1password'
cask 'xquartz'
cask 'mactex'

# Quicklook -- make quicklook better / more useful
cask 'qlstephen'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
