# Tap
tap 'beeftornado/rmtree'
tap 'universal-ctags/universal-ctags'
tap 'Homebrew/homebrew-completions'

# Brew
brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'
brew 'htop-osx'
brew 'wget'
brew 'tree'
brew 'coreutils'
brew 'gnu-which'
brew 'git'
brew 'shellcheck'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'python'
brew 'vim', args: %w[--with-lua]
brew 'p7zip'
brew 'unar'
brew 'openssl'
brew 'ssh-copy-id'
brew 'brew-rmtree'
brew 'vagrant-completion' # for cask 'vagrant'
brew 'universal-ctags', args: %w[HEAD]
brew 'youtube-dl'
brew 'ffmpeg', args: %w[--with-libvpx --with-libvorbis]
brew 'opam'

# Cask
tap 'caskroom/cask'
brew 'brew-cask'
cask 'google-chrome'
cask 'dropbox'
cask 'eclipse-java'
cask 'flux'
cask 'skype'
cask 'vagrant'
cask 'iterm2'
cask 'quicksilver'
cask 'jadengeller-helium'
cask 'appcleaner'

# Quicklook -- make quicklook better / more useful
cask 'qlstephen'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
