# This file is prioritized to include stuff that is necessary for setting up
# other stuff first and then less essential dependencies

# Minimal Applications
cask 'firefox'
cask 'iterm2'
cask '1password'

# Utilities
brew 'bash'
brew 'zsh'
brew 'starship' # prompt for bash/zsh
brew 'git'
brew 'rg'
brew 'fd'
brew 'jq'
brew 'wget'
brew 'tree'
brew 'coreutils'
tap 'neovim/homebrew-neovim'
brew 'neovim'
brew 'ssh-copy-id'
brew 'unar'
brew 'p7zip'
brew 'gh'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'

# Media & Extra Applications
cask 'vlc'
tap 'gromgit/fuse'
cask 'macfuse'
brew 'gromgit/fuse/ifuse-mac'

# Linters and Languages
brew 'shellcheck'
brew 'python'
brew 'node'

# Completion
brew 'bash-completion'
brew 'zsh-completions'

# Quicklook -- make quicklook better / more useful
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'qlstephen' # arbitrary text file ql utility
